const score = `
<info>
https://www.songsterr.com/a/wsa/blues-brothers-peter-gunn-theme-tab-s3601

<settings>
  pitchShift: -5
_ @drums: v50; $bass: v50; $guit: v50; $solo: v50; $mark: v50

<out b120 v80>
> СЧЁТ         %_
> ИНТРО        %A
> РИФ_1        %B
> СОЛО_1       %C
> СОЛО_2       %D
> СОЛО_1       %E
> СОЛО_3       %F
> СБИВКА       %G
> ИНТРО        %H
> РИФ_2        %I
> РИФ_3        %J
> СОЛО_4       %K
> РИФ_3v2      %L

<РИФ_2 b120 set>
риф_2_1_1
риф_2_1_2
риф_2_1_3
риф_2_1_4
риф_2_2_1
риф_2_2_2
риф_2_2_3
риф_2_2_4

<риф_2_1_1 b120 $> #480
$bass: лы=60 лы=60  бы=60 лы=60  ду=60 лы=60  ру=60 ту=60  $eBass*f
$guit: лу=60 лу=60  бу=60 лу=60  до=60 лу=60  ро=60 то=60 $egit*drpm
 
<риф_2_1_2 b120 $> #480
$bass: лы=60 лы=60  бы=60 лы=60  ду=60 лы=60  ру=60 ту=60  $eBass*f
$guit: лу=60 лу=60  бу=60 лу=60  до=60 лу=60  ро=60 то=60 $egit*drpm

<риф_2_1_3 b120 $> #420
$bass: лы=60 лы=60  бы=60 лы=60  ду=60 лы=60  ру=60 ду=60=120      $eBass*f
$guit: лу=60 лу=60  бу=60 лу=60  до=60 лу=60  ро=60 до=60=120:*drp $egit*drpm

<риф_2_1_4 b120 $> #420
$bass: 60 лы=60 бы=60  лы=60 бы=60  ду=60 бы=60 лы=60=120      $eBass*f
$guit: 60 лу=60 бу=60  лу=60 бу=60  до=60 бу=60 лу=60=120:*drp $egit*drpm

<риф_2_2_1 b120 $> #480
$bass: 60 лы=60  бы=60 лы=60  ду=60 лы=60  ру=60 ту=60 $eBass*f
$guit: 60 лу=60  бу=60 лу=60  до=60 лу=60  ро=60 то=60 $egit*drpm

<риф_2_2_2 b120 $> #480
$bass: лы=60 лы=60  бы=60 лы=60  ду=60 лы=60   ру=60 ту=60 $eBass*f
$guit: лу=60 лу=60  бу=60 лу=60  до=60 лу=60  ро=60 то=60  $egit*drpm

<риф_2_2_3 b120 $> #480
$bass: лы=60 лы=60  бы=60 лы=60  ду=60 лы=60   ру=60 ду=60=120     $eBass*f
$guit: лу=60 лу=60  бу=60 лу=60  до=60 лу=60  ро=60 до=60=120:*drp $egit*drpm

<риф_2_2_4 b120 $> #480
$bass: 60 лы=60  бы=60 лы=60  бы=60 ду=60   бы=60  лы=60=120      $eBass*f
$guit: 60 лу=60  бу=60 лу=60  бу=60 до=60   бу=60  лу=60=140:*drp $egit*drpm


# es1 --------------------------------------------------------------------------#
<РИФ_3 b120 set>
риф_3_1_1
риф_3_1_2
риф_3_1_3
риф_3_1_4_1
риф_3_1_1
риф_3_1_2
риф_3_1_3
риф_3_1_4_2

<РИФ_3v2 b120 set>
риф_3_1_1
риф_3_1_2
риф_3_1_3
риф_3_1_4_1
риф_3_1_1
риф_3_1_2
риф_3_1_3
риф_3_1_4_3

<риф_3_1_1 b120 $> #480
$bass: 60  лу=120    ну=60 ру=180    лы=60=120 $eBass*f
$guit: 60  ло.25=120 но=60 ро=180    лу=60=140 $egit*drp

<риф_3_1_2 b120 $> #480
$bass:  60  лу=120    ну=60 ру=180 лы=60=120 $eBass*f
$guit:  60  ло.25=120 но=60 ро=180 лу=60=140 $egit*drp

<риф_3_1_3 b120 $> #480
$bass:  60  лу=120    ну=60 ру=180 ду=60=120        $eBass*f
$guit:  60  ло.25=120 но=60 ро=180 до=60=140        $egit*drp

<риф_3_1_4_1 b120 $> #480
$bass:  60  лы=60 бы=60  лы=60 бы=60  ду=60 бы=60 лы=60=120 $eBass*f
$guit:  60  лу=60 бу=60  лу=60 бу=60  до=60 бу=60 лу=60=140:*drp   $egit*drpm

<риф_3_1_4_2 b120 $> #480
$bass:  60  лы=60 бы=60  лы=60 бы=60  ду=60 бы=60 лы=60=120 $eBass*f
$guit:  60  лу=60 бу=60  лу=60 бу=60  до=60 бу=60 лу=60=140:*drp   $egit*drpm
$solo:  420                                       ла=60=480        $organ*r

<риф_3_1_4_3 b120 $> #480
$bass:  60  лы=60 бы=60  лы=60 бы=60  ду=60 бы=60 лы=60           $eBass*f
$guit:  60  лу=60 бу=60  лу=60 бу=60  до=60 бу=60 лу=60:*drp 480  $egit*drpm

# 120  240 360 <480> 600 720 840 <960> 1080 1200 1320 <1440> 

<СОЛО_4 b120 set>
соло4_1_1
соло4_1_2
соло4_1_3
соло4_1_4
соло4_1_5
соло4_1_6
соло4_1_7
соло4_1_8

<соло4_1_1 b120 $>
$bass: 60     лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60        $eBass*f
$guit: 60     лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60        $egit*drpm
$bass: 480    лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60 $eBass*f
$guit: 480    лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60 $egit*drpm
$solo: 480 60 ка=60 | ла=60  ма=60 | са=60 ла=60 | те=60 ма=60 $organ*r

<соло4_1_2 b120 $>
$bass: 0      лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60 $eBass*f
$guit: 0      лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60 $egit*drpm
$solo: 0      са=480 $organ*r
$bass: 480    лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60 $eBass*f
$guit: 480    лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60 $egit*drpm
$solo: 480 60 ла=60 | ка=60 ла=60 | ка=60 ла=60 | за=60 ма=60  $organ*r


<соло4_1_3 b120 $>
$bass: 0      лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60 $eBass*f
$guit: 0      лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60 $egit*drpm
$solo: 0      са=480 $organ*r
$bass: 480    лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60 $eBass*f
$guit: 480    лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60 $egit*drpm
$solo: 480 60 ла=60 | за=60 са=60 | ва=60 фа=60 | ма=60 та=60 $organ*r

<соло4_1_4 b120 $>
$bass: 0    ру=60 ру=60 фу=60 су=60 зу=60 лу=60 су=60  фу=60 $eBass*f
$guit: 0    ро=60 ро=60 фо=60 со=60 зо=60 ло=60 со=60  фо=60 $egit*drpm #480
$solo: 0    ра=420 60 $organ*r
$bass: 480  ру=60 ру=60 фу=60 су=60 зу=60 лу=60 су=60  фу=60 $eBass*f
$guit: 480  ро=60 ро=60 фо=60 со=60 зо=60 ло=60 со=60  фо=60 $egit*drpm #480
$solo: 480  ре=420 60  $organ*r

<соло4_1_5 b120 $>
$bass: 0     лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60       $eBass*f
$guit: 0     лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60:*drp  $egit*drpm
$solo: 0     ла=480 $organ*r
$bass: 480   лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60       $eBass*f
$guit: 480   лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60:*drp  $egit*drpm
$solo: 480  60 ка=60 | ла=60 ма=60 | са=60 ла=60 | те=60 ма=60 $organ*r

<соло4_1_6 b120 $>
$bass: 0      лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60        $eBass*f
$guit: 0      лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60:*drp   $egit*drpm
$solo: 0      са=480 $organ*r
$bass: 480    лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60        $eBass*f
$guit: 480    лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60:*drp   $egit*drpm
$solo: 480 60 ла=60 | ка=60 ла=60 | ка=60 ла=60 | за=60 ма=60         $organ*r

<соло4_1_7 b120 $>
$bass: 0      лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60      $eBass*f
$guit: 0      лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60:*drp $egit*drpm
$solo: 0      са=480 $organ*r
$bass: 480    лы=60  лы=60 лы=60 лы=60 лы=60 лы=60 лы=60 кы=60      $eBass*f
$guit: 480    лу=60  лу=60 лу=60 лу=60 лу=60 лу=60 лу=60 ку=60:*drp $egit*drpm
$solo: 480 60 ла=60 | за=60 са=60 | ва=60 фа=60 | ма=60 та=60       $organ*r

<соло4_1_8 b120 $>
$bass: 0   ру=60 ру=60 фу=60 су=60 зу=60 лу=60 су=60  фу=60          $eBass*f
$guit: 0   ро=60 ро=60 фо=60 со=60 зо=60 ло=60 со=60  фо=60          $egit*dr
$solo: 0    ра=420 60 $organ*r
$bass: 480 ру=60 ру=60 фу=60 су=60 зу=60 лу=60 су=60  лы=60=120      $eBass*f #480
$guit: 480 ро=60 ро=60 фо=60 со=60 зо=60 ло=60 со=60  лу=60=140:*drp $egit*dr
$solo: 480  ре=420 60  $organ*r

# other ------------------------------------------------------------------------#

<РИФ_1 b120 set>
pg_bass_riff pg_guitar_riff1
pg_bass_riff pg_guitar_riff2
pg_bass_riff pg_guitar_riff1
pg_bass_riff pg_guitar_riff2

<СОЛО_1 b120 set>
pg_bass_riff pg_guitar_riff1 pg_solo1_1
pg_bass_riff pg_guitar_riff2 pg_solo1_2
pg_bass_riff pg_guitar_riff1 pg_solo1_1
pg_bass_riff pg_guitar_riff2 pg_solo1_4

<СОЛО_2 b120 set>
pg_bass_riff pg_guitar_riff1 pg_solo2_1
pg_bass_riff pg_guitar_riff2 pg_solo2_2
pg_bass_riff pg_guitar_riff1 pg_solo2_3
pg_bass_riff pg_guitar_riff2 pg_solo2_4

<Pg_riff_short b120 set>
pg_bass_riff        pg_guitar_riff1
pg_bass_riff        pg_guitar_riff2
pg_bass_riff        pg_guitar_riff1
pg_bass_riff_short  pg_guitar_riff_short

<СОЛО_3 b120 set>
pg_bass_riff pg_guitar_riff1 pg_solo2_1
pg_bass_riff pg_guitar_riff2 pg_solo2_2
pg_bass_riff pg_guitar_riff1 pg_solo2_3
pg_bass_riff_short pg_guitar_riff_short pg_solo2_4

<pg_solo2_1 b120 $>
$solo: 60 ма=60 са=60 ла=60  ка=80 ка=80 ка=80 $organ*r

<pg_solo2_2 b120 $>
$solo: ка=80 ла=80 са=80  ма=80 ра=80 ма=80 $organ*r

<pg_solo2_3 b120 $>
$solo:  та=480 $organ*r

<pg_solo2_4 b120 $>
$solo:  ло=60 $organ*r

<pg_solo1_1 b120 $>
$solo: 0    са=480_480:v10_0=0=480:v50 $organ*r

<pg_solo1_2 b120 $>
$solo: ма=60 $organ*r

<pg_solo1_4 b120 $>
$solo: ме=60 ка=60 $organ*r

<pg_bass_riff b120 $> #480
$bass: лы=60 лы=60 бы=60 лы=60  ду=60 лы=60  ру=60 ту=60 $eBass*f

<pg_guitar_riff1 b120 $>
$guit: лу=60 лу=60  бу=60 лу=60 до=60 лу=60  ро=60 то=60 $egit*drpm

<pg_guitar_riff2 b120 $>
$guit: лу=60 лу=60  бу=60 лу=60 до=60 лу=60  ро=60 то=60 $egit*drpm

<pg_guitar_riff1_old b120 $>
$guit: *EDM лу=60 *ED мо+ло=60 *EDM лу=60 лу=60 *ED мо+ло=60 *EDM лу=60 *ED со=60 ло=60 $guitar*ED

<pg_guitar_riff2_old b120 $>
$guit: *EDM лу=60 *ED ма+ла=60 *EDM лу=60 лу=60 *ED ма+ла=60 *EDM лу=60 *ED ро=60 то=60 $guitar*ED

<pg_bass_riff_short b120 $> #300
$bass: лы=60 лы=60 бы=60 лы=60 ду=60 $eBass*f

<pg_guitar_riff_short b120 $>
$guit: лу=60 лу=60 бу=60 лу=60 до=60 $egit*drp

<СБИВКА b120 set>
pg_break_1
pg_break_2
pg_break_3

<pg_break_1 b120 $>
$break: 0    ма=55 5 ма=55 5 ма=55 $xylo #180
$break: 180  ма=55 5 ла=55 5 са=30  ла=30 са=30 ма=30 та=60    ло=60 ло=60 60  $xylo #480

<pg_break_2 b120 $>
$break: ма=60  ла=60 са=60 ра=60 ма=60    мо=60 мо=60 60 $xylo #480

<pg_break_3 b120 $>
$break: ма=60  ла=60 са=30 ла=30 са=30    ма=30 та=60  ло=60 да=60 ра=60 $xylo #480

<ИНТРО b120 $>
$mark: 000    ле=60 $xylo
$bass: 000 *s лу=60 *f v30 ку=60 ку=60 ку=60 $cBass
$bass: 240 *s лу=60 *f v30 ку=60 ку=60 ку=60 $cBass
$mark: 480    ле=60 $xylo
$bass: 480 *s лу=60 *f v30 ку=60 ку=60 ку=60 $cBass
$bass: 720 *s лу=60 *f v30 ку=60 ку=60 ку=60 $cBass
#      960

<КОНЕЦ b120 $>
$bass:  лы=60      $eBass*b
$guit:  лу=60      $guitar*ED
$solo:  лу+мо=1440 $organ

<СЧЁТ b120 $>
$bass: ле=120 ле=120 ле=120 ле=120 $xylo
$guit: ле=120 ле=120 ле=120 ле=120 $xylo

`.trim();

// <div style="margin: .5rem;">
// <pre style="font-family: monospace; margin: .5rem 0 0;">
// </pre>
// </div>

const info = `
<div style="margin: .5rem;">

<br/><br/>
</div>
`.trim();

export default {
  content: info,
  tracks: [],
  score,
  exportToLineModel: false,
  ns: 'band-song',
};
