const score = `
<settings>
# boardShift: -12;
_ @drums: v50; $bass: v50; $guit: v50;

<info>
https://lyrsense.com/black_sabbath/sweet_leaf
https://www.songsterr.com/a/wsa/black-sabbath-sweet-leaf-standard-tuning-tab-s476149

<out b148>
> СЧЁТ     %_
> РИФ_1    %A [08*4*120] # A - 960 - 960 - 960 - 960
> КУПЛЕТ_1 %B [16*4*120] # B - 960 - 960 - 960 - 960 - 960 - 960 - 960 - 960
> ПРИПЕВ_1 %C [16*4*120] # C - 960 - 960 - 960 - 960 - 960 - 960 - 960 - 960
> РИФ_1    %D [08*4*120] # D - 960 - 960 - 960 - 960
> КУПЛЕТ_1 %E [16*4*120] # E - 960 - 960 - 960 - 960 - 960 - 960 - 960 - 960
> ПРИПЕВ_1 %F [16*4*120] # F - 960 - 960 - 960 - 960 - 960 - 960 - 960 - 960
> РИФ_1    %G [08*4*120] # G - 960 - 960 - 960 - 960
> КУПЛЕТ_1 %H [16*4*120] # H - 960 - 960 - 960 - 960 - 960 - 960 - 960 - 960
> ПРИПЕВ_1 %I [16*4*120] # I - 960 - 960 - 960 - 960 - 960 - 960 - 960 - 960
> КОДА     %J [02*4*120] # J - 960

<КОДА b148 set>
кода

<РИФ_1 b148 set>
риф_1_1 риф_1_1_1бас
риф_1_2 риф_1_1_2бас
риф_1_1 риф_1_1_3Vбас
риф_1_1 риф_1_1_4Vбас

<КУПЛЕТ_1 b148 set>
риф_куплет_1_1 риф_1_1_1бас
риф_куплет_1_1 риф_1_1_2бас
риф_куплет_1_1 риф_1_1_3бас
риф_куплет_1_1 риф_1_1_2бас

риф_куплет_1_1 риф_1_1_1бас
риф_куплет_1_1 риф_1_1_2бас
риф_куплет_1_1 риф_1_1_3бас
риф_куплет_1_1 риф_1_1_2бас


<СЧЁТ b105 $>
$guit: ле=120 ле=120 ле=120 ле=120 $xylo v90
$bass: ле=120 ле=120 ле=120 ле=120 $xylo v90

<кода b148 $>
$guit:  0    лу+мо=960:v50_480_0=480_0=0=480:v0 $egit*drp
$bass:  0    лы=480 $eBass*m

<риф_1_1 b148 $>
$guit:  0    лу+мо=120=130 лу+мо=120 120                 ро+ло=120_60_-1=60 $egit*drp
$guit:  0    240                     лу=60:v25 лу=60:v25                    $egit*drpm
$guit:  480  до+со=180 60                 v60  мо=60 ро=60 мо=120=130    $egit*drp
$guit:  480  120       до=60:v25 до=60:v25                       $egit*drpm

<риф_1_2 b148 $>
$guit:  0    лу+мо=120=130 лу+мо=120 120                 ро+ло=120_60_-1=60 $egit*drp
$guit:  0    240                     лу=60:v25 лу=60:v25                    $egit*drpm
$guit:  480  до+со=180 60                  v60 мо=60 ро=60 мо=60 со=60=70    $egit*drp
$guit:  480  120       до=60:v25 до=60:v25                            $egit*drpm


<риф_куплет_1_1 b148 $>
$guit:  0    лу+мо=120=130 лу+мо=120 120                 ро+ло=120_60_-1=60 $egit*drp
$guit:  0    240                     лу=60:v25 лу=60:v25                    $egit*drpm
$guit:  480  до+со=180 60                  до+со=120 ро+ло=120 $egit*drp
$guit:  480  120       до=60:v25 до=60:v25                     $egit*drpm

<риф_1_1_1бас b148 $>
$bass:  0    лы=120 лы=120 120 ру=60 ту=60 $eBass*m
$bass:  480  ду=120 ду=60 лу=120 лу=120 лу=60 $eBass*m

<риф_1_1_2бас b148 $>
$bass:  0    лы=120 лы=120 120 ру=60 ту=60 $eBass*m
$bass:  480  ду=120 ду=60 му=120 му=120 му=60 $eBass*m

<риф_1_1_3бас b148 $>
$bass:  0    лы=120 лы=120 120 ру=60 ту=60 $eBass*m
$bass:  480  ду=120 ду=60 су=120 су=120 су=60 $eBass*m

<риф_1_1_3Vбас b148 $>
$bass:  0    лы=120 лы=120 120 ру=60 ту=60 $eBass*m
$bass:  480  ду=120 ду=60 лу=120 су=120 му=60 $eBass*m

<риф_1_1_4Vбас b148 $>
$bass:  0    лы=120 лы=120 120 ру=60 ту=60 $eBass*m v30
$bass:  480  ду=120 ду=60 ду=120 ру=120 ду=60 $eBass*m v30


<ПРИПЕВ_1 b148 set>
припев_1_1 припев_1_1_бас
припев_1_2 припев_1_2_бас
припев_1_1 припев_1_1_бас
припев_1_2 припев_1_4_бас

припев_1_1 припев_1_1_бас
припев_1_2 припев_1_2_бас
припев_1_3 припев_1_1_бас
припев_1_2 припев_1_4_бас


<temp b148 set>
припев_1_1 припев_1_1_бас
припев_1_2 припев_1_2_бас
припев_1_1 припев_1_1_бас
припев_1_2 припев_1_4_бас

<припев_1_2 b148 $>
$guit:  0    мо+бо=180 лу+мо=60 лу+мо=720 $egit*drp

<припев_1_2_бас b148 $>
# *-----------
# ------*-----
# *-----------
# *-----*--*--
# ------*-----
# ------*-----
# *--*--*-----
# *--*--*-----
# 
$bass: 0      му=180 лы=60 || лы=120 | лу=60 су=60=120_30_+2=90 $eBass*m
$bass: 480 60 лу=120 лу=60 || су=60=_30_+2=30 лу=60 су=60=_30_+2=30 му=60 $eBass*m

<припев_1_4_бас b148 $>
# *-----------
# ------*-----
# *-----------
# *-----*--*--
# ------*-----
# ------*-----
# *--*--*-----
# *--*--*-----
# 
$bass: 0      му=180 лы=60 || лы=120 | ро=60=_30_+2=30 ро=60=120 $eBass*m v60
$bass: 480 60 до=120 лу=60 су=60 му=60 ру=60 ду=60 $eBass*m v60

<припев_1_1 b148 $>
$guit:  0    лу+мо=240=480  лу=60:*drpm:v15 лу=60.25:*drpm:v15 лу=60:*drpm:v15 лу=60.25:*drpm:v15 $egit*drp
$guit:  480  су+ро=240  до+со=240 $egit*drp

<припев_1_3 b148 $>
$guit:  0    лу+мо=180=480  лу=30:*drpm:v15 лу=30:*drpm:v15 лу=60:*drpm:v15 лу=30:*drpm:v15 лу=30:*drpm:v15 лу=60:*drpm:v15 лу=30:*drpm:v15 лу=30:*drpm:v15 $egit*drp
$guit:  480  су+ро=240  до+со=240 $egit*drp


<припев_1_1_бас b148 $>
$bass:  0    лы=240 лы=240 $eBass*m
$bass:  480  сы=240 ду=240 $eBass*m


`.trim();

// <div style="margin: .5rem;">
// <pre style="font-family: monospace; margin: .5rem 0 0;">
// </pre>
// </div>

const info = `
<div style="margin: .5rem;">


</div>
`.trim();

export default {
  content: info,
  tracks: [],
  score,
  exportToLineModel: true,
  ns: 'band-song',
};
